cache_result.txt
Running 30s test @ http://localhost:8080/trending/cache
  4 threads and 100000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   192.84ms   74.50ms   1.86s    84.58%
    Req/Sec     7.59k     3.17k   14.88k    68.04%
  533421 requests in 30.05s, 61.55MB read
  Socket errors: connect 89769, read 762, write 0, timeout 252
Requests/sec:  17753.26
Transfer/sec:      2.05MB