cache_result.txt
Running 5s test @ http://localhost:8080/timeline
  2 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.40ms    3.08ms  44.26ms   93.88%
    Req/Sec    14.31k     4.16k   21.12k    73.00%
  142593 requests in 5.02s, 140.75MB read
Requests/sec:  28420.90
Transfer/sec:     28.05MB