cache_result.txt
Running 30s test @ http://localhost:8080/profile/3
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.16ms  481.11us  16.87ms   81.92%
    Req/Sec    11.57k   782.83    13.26k    66.75%
  1381948 requests in 30.00s, 268.86MB read
Requests/sec:  46062.76
Transfer/sec:      8.96MB