conventional_result.txt
Running 30s test @ http://localhost:8080/trending/ttl?mode=conventional
  4 threads and 100000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    75.72ms   83.95ms   2.00s    93.15%
    Req/Sec    15.18k     5.50k   34.47k    68.38%
  1800103 requests in 30.10s, 302.14MB read
  Socket errors: connect 89769, read 0, write 0, timeout 25
  Non-2xx or 3xx responses: 1800103
Requests/sec:  59809.25
Transfer/sec:     10.04MB