db_result.txt
Running 30s test @ http://localhost:8080/trending/db
  4 threads and 100000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   265.49ms  289.08ms   2.00s    92.07%
    Req/Sec     1.68k     1.45k   12.20k    82.43%
  196092 requests in 30.04s, 37.01MB read
  Socket errors: connect 89913, read 8144, write 0, timeout 8916
  Non-2xx or 3xx responses: 183137
Requests/sec:   6527.56
Transfer/sec:      1.23MB