db_result.txt
Running 30s test @ http://localhost:8080/profile/3
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.70ms  103.21ms   1.95s    98.86%
    Req/Sec    11.50k     1.68k   17.23k    91.34%
  1348008 requests in 30.01s, 262.25MB read
  Socket errors: connect 0, read 0, write 0, timeout 73
  Non-2xx or 3xx responses: 81
Requests/sec:  44922.78
Transfer/sec:      8.74MB