db_result.txt
Running 5s test @ http://localhost:8080/timeline
  2 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.01ms    1.55ms  34.29ms   91.91%
    Req/Sec    15.18k     3.28k   21.64k    74.00%
  151171 requests in 5.01s, 149.21MB read
Requests/sec:  30200.63
Transfer/sec:     29.81MB