wrk_conventional.txt
Running 30s test @ http://localhost:8080/trending/ttl?mode=conventional&limit=10
  4 threads and 100000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   293.75ms   36.18ms 399.51ms   70.81%
    Req/Sec     8.42k     1.84k   12.69k    73.53%
  998134 requests in 30.11s, 178.67MB read
  Socket errors: connect 89769, read 19, write 0, timeout 0
Requests/sec:  33149.48
Transfer/sec:      5.93MB